<a href="https://colab.research.google.com/github/Fahim-Bin-Rafiq/Data-Analytic/blob/main/Pandas_Handling_Missing_Data_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Hi Guys,<br>
Welcome back to the pandas essentials, now we are going to talk about the missing data!<br>
## Handling Missing Data
Missing data is very common in many data analysis applications. pandas has a great ability to deal with the missing data. <br>Let's learn some convenient methods to deal with **missing data in pandas**:<br>

* isnull(), isna(), notnull(), dropna(), fillna(),

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic)
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0


**isnull(), isna(), notnull() -- Check for missing data in the dataset!**

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       0 non-null      float64
 2   C       5 non-null      int64
 3   D       4 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 292.0 bytes

In [ ]:
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [ ]:
df.isnull().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [ ]:
df.isnull().sum().sum()

8

In [ ]:
df['A'].isnull()

0    False
1    False
2     True
3    False
4     True
Name: A, dtype: bool

In [ ]:
df['A'].isnull().sum()

2

In [ ]:
df.isna()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [ ]:
df.isna().sum().sum()

8

In [ ]:
df.loc[1].isnull().sum()

2

In [ ]:
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [ ]:
df.shape

In [ ]:
df.notnull().sum()

A    3
B    0
C    5
D    4
dtype: int64

In [ ]:
df.notnull().sum().sum()

12

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
# Sum on Column "A", (NaN as 0)
df['A'].sum()

7.0

&#9758; NaN ignored for mean().

In [ ]:
df['A'].mean()

2.3333333333333335

In [ ]:
df.loc[3].sum()

37.0

**dropna(), fillna() -- Cleaning / filling the missing data**

In [ ]:
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
# for column, need to tell axis = 1
df.dropna(axis=1)

    C
0  11
1  12
2  13
3  14
4  15

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

thresh : int, default None
thresh = 3 means, it will drop any column that have less than 3 non-NaN values.

In [ ]:
df.dropna(thresh=3, axis=1)

     A   C     D
0  1.0  11  16.0
1  2.0  12   NaN
2  NaN  13  18.0
3  4.0  14  19.0
4  NaN  15  20.0

We can use fillna() to fill in the values.<br>
inplaced = True for permanent change.

In [ ]:
df.fillna(value=2)

     A    B   C     D
0  1.0  2.0  11  16.0
1  2.0  2.0  12   2.0
2  2.0  2.0  13  18.0
3  4.0  2.0  14  19.0
4  2.0  2.0  15  20.0

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

Let's fill in the values using mean of the column.

In [ ]:
df['A'].fillna(value = df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
df.fillna(method='ffill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
df.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
from sklearn.impute import SimpleImputer

In [ ]:
df2 = df.copy()
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
imputer = SimpleImputer(strategy='constant', fill_value= -1)
df2['A'] = imputer.fit_transform(df2[['A']])
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2 -1.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4 -1.0 NaN  15  20.0

In [ ]:
df2 = df.copy()
imputer = SimpleImputer(strategy='mean')
df2['A'] = imputer.fit_transform(df2[['A']])
df2

          A   B   C     D
0  1.000000 NaN  11  16.0
1  2.000000 NaN  12   NaN
2  2.333333 NaN  13  18.0
3  4.000000 NaN  14  19.0
4  2.333333 NaN  15  20.0

In [ ]:
df

In [ ]:
df2 = df.copy()
imputer = SimpleImputer(strategy='median')
df2['A'] = imputer.fit_transform(df2[['A']])
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  2.0 NaN  15  20.0

In [ ]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,18,np.nan,19,18]}
df2 = pd.DataFrame(data_dic)
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  NaN NaN  13   NaN
3  4.0 NaN  14  19.0
4  NaN NaN  15  18.0

In [ ]:
imputer = SimpleImputer(strategy='most_frequent')
df2['D'] = imputer.fit_transform(df2[['D']])
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  18.0

In [ ]:
from sklearn.impute import KNNImputer

In [ ]:
df2 = df.copy()
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
knn_imputer = KNNImputer(n_neighbors=3, weights="uniform")
df2 = knn_imputer.fit_transform(df2)
df2

array([[ 1.        , 11.        , 16.        ],
       [ 2.        , 12.        , 17.66666667],
       [ 2.33333333, 13.        , 18.        ],
       [ 4.        , 14.        , 19.        ],
       [ 2.33333333, 15.        , 20.        ]])

In [ ]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
# fill with you own given value
df.fillna(0, inplace=True)

In [ ]:
df

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

# Good Job!